{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# RAG "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Libraries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "# processing:\n",
    "import os\n",
    "import re\n",
    "import pandas as pd\n",
    "from dotenv import load_dotenv\n",
    "\n",
    "# neo4j:\n",
    "from langchain_community.graphs import Neo4jGraph\n",
    "from langchain_community.vectorstores import Neo4jVector\n",
    "\n",
    "# llm:\n",
    "from langchain.chat_models.gigachat import GigaChat\n",
    "from langchain_community.embeddings import GigaChatEmbeddings\n",
    "from langchain.prompts import ChatPromptTemplate\n",
    "from langchain_core.output_parsers import StrOutputParser\n",
    "\n",
    "# retrieval:\n",
    "from langchain.chains import RetrievalQAWithSourcesChain\n",
    "from langchain.memory import ConversationBufferMemory"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### .env"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 266,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 266,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "load_dotenv()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 267,
   "metadata": {},
   "outputs": [],
   "source": [
    "# neo4j:\n",
    "NEO4J_URI = os.getenv('NEO4J_URI')\n",
    "NEO4J_USERNAME = os.getenv('NEO4J_USERNAME')\n",
    "NEO4J_PASSWORD = os.getenv('NEO4J_PASSWORD')\n",
    "NEO4J_DATABASE= os.getenv('NEO4J_DATABASE')\n",
    "\n",
    "# llm:\n",
    "LLM_SCOPE = os.getenv('SCOPE')\n",
    "LLM_AUTH = os.getenv('AUTH_DATA')\n",
    "\n",
    "# telegram:\n",
    "BOT_TOKEN = os.getenv('BOT_TOKEN')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Reference"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 268,
   "metadata": {},
   "outputs": [],
   "source": [
    "reference = pd.read_excel('../docs/reference.xlsx')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Setting Up LLM | GigaChat\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "[GigaChat](https://developers.sber.ru/docs/ru/gigachat/overview)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 269,
   "metadata": {},
   "outputs": [],
   "source": [
    "llm = GigaChat(credentials = LLM_AUTH, \n",
    "               temperature = 0.3, \n",
    "               n = 1, \n",
    "               model = \"GigaChat-Plus\", # 32k context window\n",
    "               repetition_penalty = 1.0,\n",
    "               verify_ssl_certs = False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 270,
   "metadata": {},
   "outputs": [],
   "source": [
    "parser = StrOutputParser()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 271,
   "metadata": {},
   "outputs": [],
   "source": [
    "embeddings = GigaChatEmbeddings(credentials = LLM_AUTH, verify_ssl_certs = False)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Prompt Engineering"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Prompt Template"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 272,
   "metadata": {},
   "outputs": [],
   "source": [
    "template = \"\"\"\n",
    "            Задача: Анализировать заданный запрос и предоставлять детализированные ответы, опираясь на документы, правила и требования.\n",
    "\n",
    "            Инструкции:\n",
    "\n",
    "            1. При ответе на вопросы, особенно те, которые связаны с правилами или нормативными документами, активно ссылайтесь на номера пунктов, статей и разделов документов.\n",
    "            2. Если требуемая информация отсутствует или вы не можете обнаружить необходимые пункты в документах, используйте фразу \"Информация не найдена\".\n",
    "            3. Ваши ответы должны быть максимально точными и содержать не только ссылки на документы, но и объяснения их применения к данному запросу.\n",
    "\n",
    "            Вопрос: {question}\n",
    "            Контекст: {context}\n",
    "            \n",
    "            Ответ: Предоставьте ваш ответ, опираясь на указанные выше указания.\n",
    "            \"\"\"\n",
    "\n",
    "prompt = ChatPromptTemplate.from_template(template)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Step Back Prompting"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 273,
   "metadata": {},
   "outputs": [],
   "source": [
    "def step_back_prompt(model, parser, text):\n",
    "    \n",
    "    chain = model | parser\n",
    "\n",
    "    template = f\"\"\"\n",
    "                Задача: Анализировать представленные данные и вывести из них высокоуровневые концепции и основные принципы.\n",
    "\n",
    "                Инструкции:\n",
    "                Прежде чем приступить к абстракции, важно:\n",
    "                1. Определить и выделить ключевые детали и специфику представленного материала.\n",
    "                2. Анализировать связи между деталями для понимания более глубоких закономерностей и взаимосвязей.\n",
    "                3. Структурировать полученные данные, выделяя общие элементы и паттерны.\n",
    "                4. Формулировать высокоуровневые концепции и принципы, опираясь на проанализированные данные.\n",
    "\n",
    "                Текст: \\\"{text}\\\"\n",
    "\n",
    "                Проанализируйте и сформулируйте общие концепции и основные принципы на основе представленных деталей в виде развернутых вопросов.\n",
    "                \"\"\"\n",
    "\n",
    "    model_response = chain.invoke(template)\n",
    "    \n",
    "    return model_response"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Question Extraction"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 274,
   "metadata": {},
   "outputs": [],
   "source": [
    "def extract_question(model, parser, text):\n",
    "    \n",
    "    chain = model | parser\n",
    "\n",
    "    template = f\"\"\"\n",
    "                            Мне нужно твоё содействие в анализе следующего делового письма.\n",
    "                            Извлеки из него всю важную информацию для системы RAG. \n",
    "                            Нужны вопросы, ключевые параметры, и основные темы обсуждения. Вот текст письма:\n",
    "\n",
    "                            Текст: \\\"{text}\\\"\n",
    "\n",
    "                            Разбери письмо на следующие компоненты:\n",
    "\n",
    "                            1. Все поставленные вопросы.\n",
    "                            2. Перечень ключевых параметров, упомянутых в тексте.\n",
    "                            3. Основные темы, которые обсуждаются.\n",
    "\n",
    "                            Используй структурированный подход, чтобы я мог легко использовать эти данные для запросов в системе RAG.\n",
    "                            Без дополнительных комментариев.\n",
    "                            \"\"\"\n",
    "\n",
    "    model_response = chain.invoke(template)\n",
    "    \n",
    "    return model_response"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Setting Up Database | Neo4j"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "[Neo4j](https://workspace-preview.neo4j.io)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 275,
   "metadata": {},
   "outputs": [],
   "source": [
    "neo4j_vector = Neo4jVector.from_existing_index(\n",
    "    embeddings,\n",
    "    url = NEO4J_URI,\n",
    "    username = NEO4J_USERNAME,\n",
    "    password = NEO4J_PASSWORD,\n",
    "    index_name = \"vector\"\n",
    "    # search_type = 'hybrid'\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## LLM Retrival Chain"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "[GigaChain](https://github.com/ai-forever/gigachain)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 276,
   "metadata": {},
   "outputs": [],
   "source": [
    "chain = RetrievalQAWithSourcesChain.from_chain_type(llm,\n",
    "                                                    chain_type = \"stuff\", # \"stuff\", \"map_rerank\", \"refine\"\n",
    "                                                    retriever = neo4j_vector.as_retriever(),\n",
    "                                                    return_source_documents = False,\n",
    "                                                    reduce_k_below_max_tokens = True,\n",
    "                                                    chain_type_kwargs = {\n",
    "                                                                        \"verbose\": False,\n",
    "                                                                        \"prompt\": prompt, # step_back_prompt\n",
    "                                                                        \"document_variable_name\": \"context\",\n",
    "                                                                        \"memory\": ConversationBufferMemory(\n",
    "                                                                            memory_key='history',\n",
    "                                                                            input_key='question'),\n",
    "                                                                        }\n",
    "                                                    )"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Test"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 277,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Inquiry: Добрый день! При определении НМЦ закупки услуг по поставке и монтажу здания (не капитальное строительство) какой метод определения НМЦ должен быть? \n",
      "\n",
      "Reference: В пункте 4.9.1. Положения о закупках предусмотрено, что \"Проектно-сметный метод применяется для определения начальной (максимальной) цены договора (предмета закупки) на строительство, реконструкцию и капитальный ремонт объектов, а также может быть применен при определении начальной (максимальной) цены договора (предмета закупки) на текущий ремонт зданий, сооружений, строений, помещений\".\n",
      "\n",
      "Abstraction: На основе представленных данных можно сформулировать следующие общие концепции и основные принципы:\n",
      "\n",
      "1. При определении НМЦ закупки услуг по поставке и монтажу здания (не капитальное строительство) необходимо использовать метод определения НМЦ, который соответствует требованиям законодательства о государственных закупках.\n",
      "\n",
      "2. Для определения НМЦ следует учитывать специфику и особенности объекта закупки, такие как тип здания, его размеры, материалы, используемые при строительстве, и другие факторы, которые могут повлиять на стоимость работ.\n",
      "\n",
      "3. При выборе метода определения НМЦ необходимо учитывать конкурентоспособность рынка, наличие достаточного количества предложений от потенциальных поставщиков, а также возможность проведения переговоров с ними для достижения оптимальной цены.\n",
      "\n",
      "4. Важно обеспечить прозрачность и объективность процесса определения НМЦ, чтобы избежать коррупционных рисков и гарантировать равные условия для всех участников закупки.\n",
      "\n",
      "5. При формулировании принципов определения НМЦ следует учитывать интересы заказчика, который стремится получить наилучшее соотношение цены и качества, а также интересы поставщиков, которые стремятся предложить наиболее выгодные условия.\n",
      "\n",
      "6. Необходимо проводить анализ рынка и ценовой конкуренции, чтобы определить оптимальную цену закупки, которая будет соответствовать рыночным условиям и не превысит разумные пределы.\n",
      "\n",
      "7. При определении НМЦ следует учитывать возможные риски и неопределенности, связанные с выполнением работ, и принимать меры для минимизации этих рисков.\n",
      "\n",
      "8. Важно обеспечить эффективное управление процессом определения НМЦ, чтобы гарантировать его прозрачность, объективность и соответствие законодательству о государственных закупках.\n",
      "\n",
      "Question: 1. Вопросы:\n",
      "- Какой метод определения НМЦ должен быть при определении НМЦ закупки услуг по поставке и монтажу здания (не капитальное строительство)?\n",
      "\n",
      "2. Ключевые параметры:\n",
      "- Метод определения НМЦ\n",
      "\n",
      "3. Основные темы обсуждения:\n",
      "- Определение НМЦ закупки услуг по поставке и монтажу здания (не капитальное строительство)\n",
      "- Выбор метода определения НМЦ\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'answer': 'Для определения начальной (максимальной) цены закупки услуг по поставке и монтажу здания (не капитальное строительство) можно использовать метод сопоставимых рыночных цен (анализ рынка) или метод удельных показателей (параметрический). \\n\\nМетод сопоставимых рыночных цен (анализ рынка) предполагает использование не менее трех цен товара (работы, услуги), предлагаемых различными поставщиками (подрядчиками, исполнителями). Начальная (максимальная) цена договора (предмета закупки) определяется по формуле: НМЦ=𝑣𝑛*𝑖=1𝑛∑Ц𝑖, где: НМЦ - начальная (максимальная) цена договора (предмета закупки), определяемая методом сопоставимых рыночных цен (анализ рынка);𝑣 - количество (объем) закупаемого товара (работы, услуги); 𝑛 - количество значений, используемых в расчете.\\n\\nМетод удельных показателей (параметрический) предполагает использование действующей цены на ранее закупаемое изделие и показателя основного параметра ранее закупаемого изделия. Начальная (максимальная) цена договора (предмета закупки) определяется по формуле: НМЦ=ЦД*ХНМЦХД ( )𝑛, где: НМЦ - начальная (максимальная) цена договора (предмета закупки), определяемая методом удельных показателей (параметрический);ЦД - действующая цена на ранее закупаемое изделие; ХД - показатель основного параметра ранее закупаемого изделия; ХНМЦ - показатель основного параметра изделия, на которое определяется начальная (максимальная) цена; n - коэффициент торможения цены.\\n\\nОба метода предполагают использование объема (количества) закупаемого товара (работы, услуги) и цены (тарифа) единицы товара (работы, услуги).',\n",
       " 'sources': ''}"
      ]
     },
     "execution_count": 277,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "letter = 5 # from the reference .xlsx num + 2\n",
    "\n",
    "inquiry = str(reference['letter'][letter].replace('\\n', ' '))\n",
    "refer = str(reference['answer '][letter]).replace('\\n', ' ')\n",
    "\n",
    "abstarction = step_back_prompt(llm, parser, inquiry)\n",
    "question = extract_question(llm, parser, inquiry)\n",
    "\n",
    "\n",
    "print(f'Inquiry: {inquiry}\\n')\n",
    "print(f'Reference: {refer}\\n')\n",
    "print(f'Abstraction: {abstarction}\\n')\n",
    "\n",
    "print(f'Question: {question}\\n')\n",
    "\n",
    "chain.invoke(\n",
    "            {\"question\": question},\n",
    "            return_only_outputs = True,\n",
    "            )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 278,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n",
      "Score:  0.944155752658844\n",
      "истерства экономического  развития Российской Федерации (для продукции, которая может быть отнесена к потребительским товарам, в качествеИЦП𝑖𝑖−1отр применяется индекс потребительских цен);  С - коэффициент сдерживания темпов роста цен, определяемый в соответствии с локальными нормативными актами ПАО «Компания 1» (если применимо). \n",
      "4.5.12 В целях определения начальной (максимальной) цены договора (предмета  закупки) методом сопоставимых рыночных цен (анализ рынка) рекомендуется  использовать не менее трех цен товара (работы, услуги), предлагаемых различными  поставщиками (подрядчиками, исполнителями). \n",
      "4.5.13 Начальная (максимальная) цена договора (предмета закупки) методом  сопоставимых рыночных цен (анализ рынка) определяется по формуле: НМЦ=𝑣𝑛*𝑖=1𝑛∑Ц𝑖 где: НМЦ - начальная (максимальная) цена договора (предмета закупки), определяемая методом сопоставимых рыночных цен (анализ рынка);𝑣 - количество (объем) закупаемого товара (работы, услуги); 𝑛 - количество значений, используемых в расч\n",
      "--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n",
      "--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n",
      "Score:  0.9432045221328735\n",
      "4.6.7. Начальная (максимальная) цена договора (предмета закупки) методом удельных показателей (параметрический) определяется по формуле: НМЦ=ЦД*ХНМЦХД ( )𝑛 где: НМЦ - начальная (максимальная) цена договора (предмета закупки), определяемая методом удельных показателей (параметрический);ЦД - действующая цена на ранее закупаемое изделие; ХД - показатель основного параметра ранее закупаемого изделия; ХНМЦ - показатель основного параметра изделия, на которое определяется начальная (максимальная) цена; n - коэффициент торможения цены.\n",
      "--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n",
      "--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n",
      "Score:  0.9425801038742065\n",
      "ование Годового плана закупок» \n",
      "\n",
      "Взаимосвязь со смежными процессами/подпроцессами Взаимосвязь со смежными процессами/подпроцессами указана в таблице 3. Таблица 3 \n",
      "\n",
      "Порядок выполнения процесса «Формирование Годового плана закупок» Таблица 4  \n",
      "\n",
      "Матрица ответственности по процессу «Формирование Годового плана закупок» Таблица 5. Закрепление ответственности за выполнение операций.   \n",
      "\n",
      "Приложение 1 (рекомендуемое) Примеры расчета начальной максимальной цены (НМЦ)    Настоящие примеры могут быть изменены участником процесса при выполнении расчета начальной максимальной цены (НМЦ).    \n",
      "Библиография Федеральный закон от 18.07.2011 № 223-ФЗ «О закупках товаров, работ, услуг отдельными видами юридических лиц»  \n",
      "История изменений документа\n",
      "--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n",
      "--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n",
      "Score:  0.9420526027679443\n",
      "4.8.2. Начальная (максимальная) цена договора (предмета закупки) тарифным методом (НМЦтариф) определяется по формуле: НМЦтариф = V* Цтариф где: V - количество (объем) закупаемого товара (работы, услуги); Цтариф - цена (тариф) единицы товара (работы, услуги).\n",
      "--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n",
      "--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n",
      "Score:  0.9406623244285583\n",
      "4.3. Метод сопоставимых рыночных цен (анализ рынка) является  приоритетным для определения и обоснования начальной (максимальной) цены 6 Правила настоящего раздела также используются подразделением, ответственным за формирование цен договоров, заключаемых ПАО «Компания 1» и Обществами Компания 1 с единственным поставщиком (подрядчиком, исполнителем), для определения цены договора, заключаемого в случаях, предусмотренных в разделе 17 (за исключением пунктов 17.1.3, 17.1.4, 17.1.6). 5 Перечень документов устанавливается Центральным органом управления закупками, и размещается на сайте ПАО «Компания 1» в сети Интернет. договора (предмета закупки). Использование иных методов возможно в случаях,  предусмотренных настоящим разделом.\n",
      "--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n"
     ]
    }
   ],
   "source": [
    "docs_with_score = neo4j_vector.similarity_search_with_score(question, k = 5)\n",
    "\n",
    "for doc, score in docs_with_score:\n",
    "    print(\"-\" * 200)\n",
    "    print(\"Score: \", score)\n",
    "    print(doc.page_content)\n",
    "    print(\"-\" * 200)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Basic Queries | Neo4j"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "[Cypher](https://neo4j.com/docs/cypher-cheat-sheet/5/auradb-enterprise)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 279,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph = Neo4jGraph(url = NEO4J_URI, username = NEO4J_USERNAME, password = NEO4J_PASSWORD, database = NEO4J_DATABASE)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 280,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node properties are the following:\n",
      "Chunk {embedding: LIST, id: STRING, text: STRING, source: STRING, title: STRING}\n",
      "Relationship properties are the following:\n",
      "\n",
      "The relationships are the following:\n",
      "\n"
     ]
    }
   ],
   "source": [
    "print(graph.schema)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 281,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'id': 2,\n",
       "  'name': 'vector',\n",
       "  'state': 'ONLINE',\n",
       "  'populationPercent': 100.0,\n",
       "  'type': 'VECTOR',\n",
       "  'entityType': 'NODE',\n",
       "  'labelsOrTypes': ['Chunk'],\n",
       "  'properties': ['embedding'],\n",
       "  'indexProvider': 'vector-2.0',\n",
       "  'owningConstraint': None,\n",
       "  'lastRead': neo4j.time.DateTime(2024, 4, 15, 8, 9, 28, 786000000, tzinfo=<UTC>),\n",
       "  'readCount': 168}]"
      ]
     },
     "execution_count": 281,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "  SHOW VECTOR INDEXES\n",
    "  \"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 282,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'count(n)': 1087}]"
      ]
     },
     "execution_count": 282,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "  MATCH (n)\n",
    "  RETURN count(n)\n",
    "  \"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 283,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'text': '1.2. Термины и определения'}]"
      ]
     },
     "execution_count": 283,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "    MATCH (n:Chunk {title: \"1.2\"})\n",
    "    RETURN n.text AS text\n",
    "    \"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 284,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Highest scored document number: 21.2\n"
     ]
    }
   ],
   "source": [
    "highest_scored_content = str(neo4j_vector.similarity_search(inquiry, k=3))\n",
    "\n",
    "match = re.search(r'\\d+(\\.\\d+)+', highest_scored_content)\n",
    "\n",
    "if match:\n",
    "    highest_scored_document_number = match.group(0)\n",
    "    print(\"Highest scored document number:\", highest_scored_document_number)\n",
    "\n",
    "else:\n",
    "    print(\"No matching number found\")\n",
    "\n",
    "if match:\n",
    "    cypher_query = f\"\"\"\n",
    "                    MATCH (n)\n",
    "                    WHERE n.title STARTS WITH '{highest_scored_document_number}'\n",
    "                    RETURN n.text\n",
    "                    \"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 285,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'n.text': '21.2. Закупки проводятся способом - маркетинговые исследования, если иной способ закупки из числа предусмотренных пунктами 6.2.1, 6.2.2, не определен Центральным органом управления закупками на стадии планирования Закупок.'}]"
      ]
     },
     "execution_count": 285,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.query(cypher_query)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.4"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
